export interface Faq {
  question: string;
  answer: string;
}

export const faqs: Faq[] = [
  {
    question: 'Allef مناسبة لمين؟',
    answer:
      'Allef موجهة لطلبة البكالوريا المصريين الذين يدرسون مادة البرمجة والذكاء الاصطناعي، وكذلك لأولياء الأمور الذين يريدون متابعة تعلّم أبنائهم.',
  },
  {
    question: 'هل Allef مخصصة لطلبة البكالوريا؟',
    answer:
      'نعم، المحتوى مصمم ومخصّص خصيصًا لطلبة البكالوريا بما يتناسب مع المنهج ومستوى الطالب.',
  },
  {
    question: 'هل يمكن مشاهدة الدروس في أي وقت؟',
    answer:
      'نعم، المحتوى التعليمي متاح بحيث يستطيع الطالب التعلم في الوقت الذي يناسبه.',
  },
  {
    question: 'هل ستتوفر اختبارات وتدريبات؟',
    answer:
      'متوفر بالفعل تدريبات واختبارات تساعد الطالب على قياس فهمه وتطبيق ما تعلّمه. وهي ضمن التطوير المستقبلي لـ Allef.',
  },
  {
    question: 'إزاي أقدر أتواصل مع المدرّسة؟',
    answer:
      'يمكنك التواصل مع م. إسراء سمير مباشرة عبر زر الواتساب الموجود في الصفحة، وسيتم فتح محادثة مباشرة معها.',
  },
  {
    question: 'هل أحتاج إلى إنشاء حساب لاستخدام المنصة؟',
    answer:'نعم تحتاج الى انشاء حساب فى منصة Allef ليمكنك الوصول الى المحتوى التعليمى والمميزات الاضافية'',
  },
];
